Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes
The SectionMarkAttributes class is the attributes class for section marks.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.MarkName
The section mark name.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.LineLength
The length of the section mark lines.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.LineWidth
The width of the section mark lines.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.LineLengthOffset
The offset from the end of the line on both sides of the section mark.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.LineWidthOffsetLeft
The offset from the start of the line on the left side of the section mark.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.LineWidthOffsetRight
The offset from the start of the line on the right side of the section mark.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.LineColor
The color of the section mark line (see Tekla.Structures.Drawing.DrawingColors for options).

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.TrueLineColor
The true color (rgb enabled) of the line.
Throws System.ArgumentOutOfRangeException: The get method will
throw if the inputColor is not supported (0-7, 120 for example).
You should use this function in a try-catch statement, since
non-supported colors are used in TeklaStructures, especially in
older models. Define your own catch logic (default color, error
message, etc) based on your use case.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.SymbolColor
The color of the mark symbols (see Tekla.Structures.Drawing.DrawingColors for options).

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.TrueSymbolColor
The true color (rgb enabled) of the symbol.
Throws System.ArgumentOutOfRangeException: The get method will
throw if the inputColor is not supported (0-7, 120 for example).
You should use this function in a try-catch statement, since
non-supported colors are used in TeklaStructures, especially in
older models. Define your own catch logic (default color, error
message, etc) based on your use case.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.LeftSymbol
The symbol to use on the left side of the section mark.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.RightSymbol
The symbol to use on the right side of the section mark.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.TagsAttributes
The tags A1-A5 in the section mark attributes.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.#ctor
Creates a new default SectionMarkAttributes instance that loads standard attributes.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.#ctor(System.String)
Creates a new SectionMarkAttributes instance that loads the specified attributes.
AttributesFile: The attributes file's filename.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.#ctor(System.Boolean)
Creates a new default SectionMarkAttributes instance that does not load standard attributes.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
attributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.